----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv1d-1              [-1, 16, 138]           2,064
            Conv1d-2              [-1, 16, 138]           2,064
           Chomp1d-3              [-1, 16, 124]               0
           Chomp1d-4              [-1, 16, 124]               0
        TConvLayer-5              [-1, 16, 124]               0
            Conv1d-6              [-1, 16, 138]           2,064
            Conv1d-7              [-1, 16, 138]           2,064
           Chomp1d-8              [-1, 16, 124]               0
           Chomp1d-9              [-1, 16, 124]               0
       TConvLayer-10              [-1, 16, 124]               0
           Conv1d-11              [-1, 16, 138]           2,064
           Conv1d-12              [-1, 16, 138]           2,064
          Chomp1d-13              [-1, 16, 124]               0
          Chomp1d-14              [-1, 16, 124]               0
       TConvLayer-15              [-1, 16, 124]               0
       TConvBlock-16              [-1, 16, 124]               0
      BatchNorm1d-17              [-1, 16, 124]              32
             ReLU-18              [-1, 16, 124]               0
           Conv1d-19              [-1, 16, 138]           2,064
           Conv1d-20              [-1, 16, 138]           2,064
          Chomp1d-21              [-1, 16, 124]               0
          Chomp1d-22              [-1, 16, 124]               0
       TConvLayer-23              [-1, 16, 124]               0
           Conv1d-24              [-1, 16, 138]           2,064
           Conv1d-25              [-1, 16, 138]           2,064
          Chomp1d-26              [-1, 16, 124]               0
          Chomp1d-27              [-1, 16, 124]               0
       TConvLayer-28              [-1, 16, 124]               0
           Conv1d-29              [-1, 16, 138]           2,064
           Conv1d-30              [-1, 16, 138]           2,064
          Chomp1d-31              [-1, 16, 124]               0
          Chomp1d-32              [-1, 16, 124]               0
       TConvLayer-33              [-1, 16, 124]               0
       TConvBlock-34              [-1, 16, 124]               0
      BatchNorm1d-35              [-1, 16, 124]              32
             ReLU-36              [-1, 16, 124]               0
           Conv1d-37              [-1, 32, 138]           4,128
           Conv1d-38              [-1, 32, 138]           4,128
          Chomp1d-39              [-1, 32, 124]               0
          Chomp1d-40              [-1, 32, 124]               0
           Conv1d-41              [-1, 32, 124]             544
       TConvLayer-42              [-1, 32, 124]               0
           Conv1d-43              [-1, 32, 138]           8,224
           Conv1d-44              [-1, 32, 138]           8,224
          Chomp1d-45              [-1, 32, 124]               0
          Chomp1d-46              [-1, 32, 124]               0
       TConvLayer-47              [-1, 32, 124]               0
           Conv1d-48              [-1, 32, 138]           8,224
           Conv1d-49              [-1, 32, 138]           8,224
          Chomp1d-50              [-1, 32, 124]               0
          Chomp1d-51              [-1, 32, 124]               0
       TConvLayer-52              [-1, 32, 124]               0
       TConvBlock-53              [-1, 32, 124]               0
      BatchNorm1d-54              [-1, 32, 124]              64
             ReLU-55              [-1, 32, 124]               0
           Conv1d-56              [-1, 32, 106]           8,224
           Conv1d-57              [-1, 32, 106]           8,224
          Chomp1d-58               [-1, 32, 92]               0
          Chomp1d-59               [-1, 32, 92]               0
       TConvLayer-60               [-1, 32, 92]               0
           Conv1d-61              [-1, 32, 106]           8,224
           Conv1d-62              [-1, 32, 106]           8,224
          Chomp1d-63               [-1, 32, 92]               0
          Chomp1d-64               [-1, 32, 92]               0
       TConvLayer-65               [-1, 32, 92]               0
           Conv1d-66              [-1, 32, 106]           8,224
           Conv1d-67              [-1, 32, 106]           8,224
          Chomp1d-68               [-1, 32, 92]               0
          Chomp1d-69               [-1, 32, 92]               0
       TConvLayer-70               [-1, 32, 92]               0
       TConvBlock-71               [-1, 32, 92]               0
      BatchNorm1d-72               [-1, 32, 92]              64
             ReLU-73               [-1, 32, 92]               0
           Conv1d-74              [-1, 64, 106]          16,448
           Conv1d-75              [-1, 64, 106]          16,448
          Chomp1d-76               [-1, 64, 92]               0
          Chomp1d-77               [-1, 64, 92]               0
           Conv1d-78               [-1, 64, 92]           2,112
       TConvLayer-79               [-1, 64, 92]               0
           Conv1d-80              [-1, 64, 106]          32,832
           Conv1d-81              [-1, 64, 106]          32,832
          Chomp1d-82               [-1, 64, 92]               0
          Chomp1d-83               [-1, 64, 92]               0
       TConvLayer-84               [-1, 64, 92]               0
           Conv1d-85              [-1, 64, 106]          32,832
           Conv1d-86              [-1, 64, 106]          32,832
          Chomp1d-87               [-1, 64, 92]               0
          Chomp1d-88               [-1, 64, 92]               0
       TConvLayer-89               [-1, 64, 92]               0
       TConvBlock-90               [-1, 64, 92]               0
      BatchNorm1d-91               [-1, 64, 92]             128
             ReLU-92               [-1, 64, 92]               0
           Conv1d-93              [-1, 64, 106]          32,832
           Conv1d-94              [-1, 64, 106]          32,832
          Chomp1d-95               [-1, 64, 92]               0
          Chomp1d-96               [-1, 64, 92]               0
       TConvLayer-97               [-1, 64, 92]               0
           Conv1d-98              [-1, 64, 106]          32,832
           Conv1d-99              [-1, 64, 106]          32,832
         Chomp1d-100               [-1, 64, 92]               0
         Chomp1d-101               [-1, 64, 92]               0
      TConvLayer-102               [-1, 64, 92]               0
          Conv1d-103              [-1, 64, 106]          32,832
          Conv1d-104              [-1, 64, 106]          32,832
         Chomp1d-105               [-1, 64, 92]               0
         Chomp1d-106               [-1, 64, 92]               0
      TConvLayer-107               [-1, 64, 92]               0
      TConvBlock-108               [-1, 64, 92]               0
     BatchNorm1d-109               [-1, 64, 92]             128
            ReLU-110               [-1, 64, 92]               0
          Conv1d-111              [-1, 128, 74]          65,664
          Conv1d-112              [-1, 128, 74]          65,664
         Chomp1d-113              [-1, 128, 60]               0
         Chomp1d-114              [-1, 128, 60]               0
          Conv1d-115              [-1, 128, 60]           8,320
      TConvLayer-116              [-1, 128, 60]               0
          Conv1d-117              [-1, 128, 74]         131,200
          Conv1d-118              [-1, 128, 74]         131,200
         Chomp1d-119              [-1, 128, 60]               0
         Chomp1d-120              [-1, 128, 60]               0
      TConvLayer-121              [-1, 128, 60]               0
      TConvBlock-122              [-1, 128, 60]               0
     BatchNorm1d-123              [-1, 128, 60]             256
            ReLU-124              [-1, 128, 60]               0
          Conv1d-125              [-1, 128, 74]         131,200
          Conv1d-126              [-1, 128, 74]         131,200
         Chomp1d-127              [-1, 128, 60]               0
         Chomp1d-128              [-1, 128, 60]               0
      TConvLayer-129              [-1, 128, 60]               0
          Conv1d-130              [-1, 128, 74]         131,200
          Conv1d-131              [-1, 128, 74]         131,200
         Chomp1d-132              [-1, 128, 60]               0
         Chomp1d-133              [-1, 128, 60]               0
      TConvLayer-134              [-1, 128, 60]               0
      TConvBlock-135              [-1, 128, 60]               0
     BatchNorm1d-136              [-1, 128, 60]             256
            ReLU-137              [-1, 128, 60]               0
          Conv1d-138              [-1, 256, 74]         262,400
          Conv1d-139              [-1, 256, 74]         262,400
         Chomp1d-140              [-1, 256, 60]               0
         Chomp1d-141              [-1, 256, 60]               0
          Conv1d-142              [-1, 256, 60]          33,024
      TConvLayer-143              [-1, 256, 60]               0
          Conv1d-144              [-1, 256, 74]         524,544
          Conv1d-145              [-1, 256, 74]         524,544
         Chomp1d-146              [-1, 256, 60]               0
         Chomp1d-147              [-1, 256, 60]               0
      TConvLayer-148              [-1, 256, 60]               0
      TConvBlock-149              [-1, 256, 60]               0
     BatchNorm1d-150              [-1, 256, 60]             512
            ReLU-151              [-1, 256, 60]               0
          Conv1d-152                [-1, 6, 74]          12,294
          Conv1d-153                [-1, 6, 74]          12,294
         Chomp1d-154                [-1, 6, 60]               0
         Chomp1d-155                [-1, 6, 60]               0
          Conv1d-156                [-1, 6, 60]           1,542
      TConvLayer-157                [-1, 6, 60]               0
          Conv1d-158                [-1, 6, 74]             294
          Conv1d-159                [-1, 6, 74]             294
         Chomp1d-160                [-1, 6, 60]               0
         Chomp1d-161                [-1, 6, 60]               0
      TConvLayer-162                [-1, 6, 60]               0
      TConvBlock-163                [-1, 6, 60]               0
================================================================
Total params: 3,041,086
Trainable params: 3,041,086
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 6.81
Params size (MB): 11.60
Estimated Total Size (MB): 18.42
----------------------------------------------------------------
Training Length: 1053