----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv1d-1               [-1, 16, 98]           2,064
            Conv1d-2               [-1, 16, 98]           2,064
           Chomp1d-3               [-1, 16, 84]               0
           Chomp1d-4               [-1, 16, 84]               0
        TConvLayer-5               [-1, 16, 84]               0
            Conv1d-6               [-1, 16, 98]           2,064
            Conv1d-7               [-1, 16, 98]           2,064
           Chomp1d-8               [-1, 16, 84]               0
           Chomp1d-9               [-1, 16, 84]               0
       TConvLayer-10               [-1, 16, 84]               0
           Conv1d-11               [-1, 16, 98]           2,064
           Conv1d-12               [-1, 16, 98]           2,064
          Chomp1d-13               [-1, 16, 84]               0
          Chomp1d-14               [-1, 16, 84]               0
       TConvLayer-15               [-1, 16, 84]               0
       TConvBlock-16               [-1, 16, 84]               0
      BatchNorm1d-17               [-1, 16, 84]              32
             ReLU-18               [-1, 16, 84]               0
           Conv1d-19               [-1, 32, 98]           4,128
           Conv1d-20               [-1, 32, 98]           4,128
          Chomp1d-21               [-1, 32, 84]               0
          Chomp1d-22               [-1, 32, 84]               0
           Conv1d-23               [-1, 32, 84]             544
       TConvLayer-24               [-1, 32, 84]               0
           Conv1d-25               [-1, 32, 98]           8,224
           Conv1d-26               [-1, 32, 98]           8,224
          Chomp1d-27               [-1, 32, 84]               0
          Chomp1d-28               [-1, 32, 84]               0
       TConvLayer-29               [-1, 32, 84]               0
           Conv1d-30               [-1, 32, 98]           8,224
           Conv1d-31               [-1, 32, 98]           8,224
          Chomp1d-32               [-1, 32, 84]               0
          Chomp1d-33               [-1, 32, 84]               0
       TConvLayer-34               [-1, 32, 84]               0
       TConvBlock-35               [-1, 32, 84]               0
      BatchNorm1d-36               [-1, 32, 84]              64
             ReLU-37               [-1, 32, 84]               0
           Conv1d-38               [-1, 32, 66]           8,224
           Conv1d-39               [-1, 32, 66]           8,224
          Chomp1d-40               [-1, 32, 52]               0
          Chomp1d-41               [-1, 32, 52]               0
       TConvLayer-42               [-1, 32, 52]               0
           Conv1d-43               [-1, 32, 66]           8,224
           Conv1d-44               [-1, 32, 66]           8,224
          Chomp1d-45               [-1, 32, 52]               0
          Chomp1d-46               [-1, 32, 52]               0
       TConvLayer-47               [-1, 32, 52]               0
       TConvBlock-48               [-1, 32, 52]               0
      BatchNorm1d-49               [-1, 32, 52]              64
             ReLU-50               [-1, 32, 52]               0
           Conv1d-51               [-1, 64, 66]          16,448
           Conv1d-52               [-1, 64, 66]          16,448
          Chomp1d-53               [-1, 64, 52]               0
          Chomp1d-54               [-1, 64, 52]               0
           Conv1d-55               [-1, 64, 52]           2,112
       TConvLayer-56               [-1, 64, 52]               0
           Conv1d-57               [-1, 64, 66]          32,832
           Conv1d-58               [-1, 64, 66]          32,832
          Chomp1d-59               [-1, 64, 52]               0
          Chomp1d-60               [-1, 64, 52]               0
       TConvLayer-61               [-1, 64, 52]               0
       TConvBlock-62               [-1, 64, 52]               0
      BatchNorm1d-63               [-1, 64, 52]             128
             ReLU-64               [-1, 64, 52]               0
           Conv1d-65               [-1, 64, 34]          32,832
           Conv1d-66               [-1, 64, 34]          32,832
          Chomp1d-67               [-1, 64, 20]               0
          Chomp1d-68               [-1, 64, 20]               0
       TConvLayer-69               [-1, 64, 20]               0
       TConvBlock-70               [-1, 64, 20]               0
      BatchNorm1d-71               [-1, 64, 20]             128
             ReLU-72               [-1, 64, 20]               0
           Conv1d-73                [-1, 6, 34]           3,078
           Conv1d-74                [-1, 6, 34]           3,078
          Chomp1d-75                [-1, 6, 20]               0
          Chomp1d-76                [-1, 6, 20]               0
           Conv1d-77                [-1, 6, 20]             390
       TConvLayer-78                [-1, 6, 20]               0
       TConvBlock-79                [-1, 6, 20]               0
================================================================
Total params: 260,274
Trainable params: 260,274
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 1.27
Params size (MB): 0.99
Estimated Total Size (MB): 2.26
----------------------------------------------------------------
Training Length: 1053
Training
