----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv1d-1               [-1, 16, 79]           2,064
            Conv1d-2               [-1, 16, 79]           2,064
           Chomp1d-3               [-1, 16, 65]               0
           Chomp1d-4               [-1, 16, 65]               0
        TConvLayer-5               [-1, 16, 65]               0
            Conv1d-6               [-1, 16, 79]           2,064
            Conv1d-7               [-1, 16, 79]           2,064
           Chomp1d-8               [-1, 16, 65]               0
           Chomp1d-9               [-1, 16, 65]               0
       TConvLayer-10               [-1, 16, 65]               0
           Conv1d-11               [-1, 16, 79]           2,064
           Conv1d-12               [-1, 16, 79]           2,064
          Chomp1d-13               [-1, 16, 65]               0
          Chomp1d-14               [-1, 16, 65]               0
       TConvLayer-15               [-1, 16, 65]               0
       TConvBlock-16               [-1, 16, 65]               0
      BatchNorm1d-17               [-1, 16, 65]              32
             ReLU-18               [-1, 16, 65]               0
           Conv1d-19               [-1, 32, 79]           4,128
           Conv1d-20               [-1, 32, 79]           4,128
          Chomp1d-21               [-1, 32, 65]               0
          Chomp1d-22               [-1, 32, 65]               0
           Conv1d-23               [-1, 32, 65]             544
       TConvLayer-24               [-1, 32, 65]               0
           Conv1d-25               [-1, 32, 79]           8,224
           Conv1d-26               [-1, 32, 79]           8,224
          Chomp1d-27               [-1, 32, 65]               0
          Chomp1d-28               [-1, 32, 65]               0
       TConvLayer-29               [-1, 32, 65]               0
           Conv1d-30               [-1, 32, 79]           8,224
           Conv1d-31               [-1, 32, 79]           8,224
          Chomp1d-32               [-1, 32, 65]               0
          Chomp1d-33               [-1, 32, 65]               0
       TConvLayer-34               [-1, 32, 65]               0
       TConvBlock-35               [-1, 32, 65]               0
      BatchNorm1d-36               [-1, 32, 65]              64
             ReLU-37               [-1, 32, 65]               0
           Conv1d-38               [-1, 32, 79]           8,224
           Conv1d-39               [-1, 32, 79]           8,224
          Chomp1d-40               [-1, 32, 65]               0
          Chomp1d-41               [-1, 32, 65]               0
       TConvLayer-42               [-1, 32, 65]               0
           Conv1d-43               [-1, 32, 79]           8,224
           Conv1d-44               [-1, 32, 79]           8,224
          Chomp1d-45               [-1, 32, 65]               0
          Chomp1d-46               [-1, 32, 65]               0
       TConvLayer-47               [-1, 32, 65]               0
           Conv1d-48               [-1, 32, 79]           8,224
           Conv1d-49               [-1, 32, 79]           8,224
          Chomp1d-50               [-1, 32, 65]               0
          Chomp1d-51               [-1, 32, 65]               0
       TConvLayer-52               [-1, 32, 65]               0
       TConvBlock-53               [-1, 32, 65]               0
      BatchNorm1d-54               [-1, 32, 65]              64
             ReLU-55               [-1, 32, 65]               0
           Conv1d-56               [-1, 32, 68]           8,224
           Conv1d-57               [-1, 32, 68]           8,224
          Chomp1d-58               [-1, 32, 54]               0
          Chomp1d-59               [-1, 32, 54]               0
       TConvLayer-60               [-1, 32, 54]               0
           Conv1d-61               [-1, 32, 68]           8,224
           Conv1d-62               [-1, 32, 68]           8,224
          Chomp1d-63               [-1, 32, 54]               0
          Chomp1d-64               [-1, 32, 54]               0
       TConvLayer-65               [-1, 32, 54]               0
       TConvBlock-66               [-1, 32, 54]               0
      BatchNorm1d-67               [-1, 32, 54]              64
             ReLU-68               [-1, 32, 54]               0
           Conv1d-69               [-1, 16, 68]           4,112
           Conv1d-70               [-1, 16, 68]           4,112
          Chomp1d-71               [-1, 16, 54]               0
          Chomp1d-72               [-1, 16, 54]               0
           Conv1d-73               [-1, 16, 54]             528
       TConvLayer-74               [-1, 16, 54]               0
           Conv1d-75               [-1, 16, 68]           2,064
           Conv1d-76               [-1, 16, 68]           2,064
          Chomp1d-77               [-1, 16, 54]               0
          Chomp1d-78               [-1, 16, 54]               0
       TConvLayer-79               [-1, 16, 54]               0
       TConvBlock-80               [-1, 16, 54]               0
      BatchNorm1d-81               [-1, 16, 54]              32
             ReLU-82               [-1, 16, 54]               0
           Linear-83                  [-1, 128]         110,720
             ReLU-84                  [-1, 128]               0
           Linear-85                    [-1, 6]             774
================================================================
Total params: 260,950
Trainable params: 260,950
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 1.07
Params size (MB): 1.00
Estimated Total Size (MB): 2.07
----------------------------------------------------------------