----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv1d-1              [-1, 16, 138]           2,064
            Conv1d-2              [-1, 16, 138]           2,064
           Chomp1d-3              [-1, 16, 124]               0
           Chomp1d-4              [-1, 16, 124]               0
        TConvLayer-5              [-1, 16, 124]               0
            Conv1d-6              [-1, 16, 138]           2,064
            Conv1d-7              [-1, 16, 138]           2,064
           Chomp1d-8              [-1, 16, 124]               0
           Chomp1d-9              [-1, 16, 124]               0
       TConvLayer-10              [-1, 16, 124]               0
           Conv1d-11              [-1, 16, 138]           2,064
           Conv1d-12              [-1, 16, 138]           2,064
          Chomp1d-13              [-1, 16, 124]               0
          Chomp1d-14              [-1, 16, 124]               0
       TConvLayer-15              [-1, 16, 124]               0
       TConvBlock-16              [-1, 16, 124]               0

      BatchNorm1d-17              [-1, 16, 124]              32
             ReLU-18              [-1, 16, 124]               0

           Conv1d-19              [-1, 32, 138]           4,128
           Conv1d-20              [-1, 32, 138]           4,128
          Chomp1d-21              [-1, 32, 124]               0
          Chomp1d-22              [-1, 32, 124]               0
           Conv1d-23              [-1, 32, 124]             544
       TConvLayer-24              [-1, 32, 124]               0
           Conv1d-25              [-1, 32, 138]           8,224
           Conv1d-26              [-1, 32, 138]           8,224
          Chomp1d-27              [-1, 32, 124]               0
          Chomp1d-28              [-1, 32, 124]               0
       TConvLayer-29              [-1, 32, 124]               0
           Conv1d-30              [-1, 32, 138]           8,224
           Conv1d-31              [-1, 32, 138]           8,224
          Chomp1d-32              [-1, 32, 124]               0
          Chomp1d-33              [-1, 32, 124]               0
       TConvLayer-34              [-1, 32, 124]               0
       TConvBlock-35              [-1, 32, 124]               0

      BatchNorm1d-36              [-1, 32, 124]              64
             ReLU-37              [-1, 32, 124]               0

           Conv1d-38              [-1, 32, 106]           8,224
           Conv1d-39              [-1, 32, 106]           8,224
          Chomp1d-40               [-1, 32, 92]               0
          Chomp1d-41               [-1, 32, 92]               0
       TConvLayer-42               [-1, 32, 92]               0
           Conv1d-43              [-1, 32, 106]           8,224
           Conv1d-44              [-1, 32, 106]           8,224
          Chomp1d-45               [-1, 32, 92]               0
          Chomp1d-46               [-1, 32, 92]               0
       TConvLayer-47               [-1, 32, 92]               0
           Conv1d-48              [-1, 32, 106]           8,224
           Conv1d-49              [-1, 32, 106]           8,224
          Chomp1d-50               [-1, 32, 92]               0
          Chomp1d-51               [-1, 32, 92]               0
       TConvLayer-52               [-1, 32, 92]               0
       TConvBlock-53               [-1, 32, 92]               0

      BatchNorm1d-54               [-1, 32, 92]              64
             ReLU-55               [-1, 32, 92]               0

           Conv1d-56              [-1, 64, 106]          16,448
           Conv1d-57              [-1, 64, 106]          16,448
          Chomp1d-58               [-1, 64, 92]               0
          Chomp1d-59               [-1, 64, 92]               0
           Conv1d-60               [-1, 64, 92]           2,112
       TConvLayer-61               [-1, 64, 92]               0
           Conv1d-62              [-1, 64, 106]          32,832
           Conv1d-63              [-1, 64, 106]          32,832
          Chomp1d-64               [-1, 64, 92]               0
          Chomp1d-65               [-1, 64, 92]               0
       TConvLayer-66               [-1, 64, 92]               0
           Conv1d-67              [-1, 64, 106]          32,832
           Conv1d-68              [-1, 64, 106]          32,832
          Chomp1d-69               [-1, 64, 92]               0
          Chomp1d-70               [-1, 64, 92]               0
       TConvLayer-71               [-1, 64, 92]               0
       TConvBlock-72               [-1, 64, 92]               0

      BatchNorm1d-73               [-1, 64, 92]             128
             ReLU-74               [-1, 64, 92]               0

           Conv1d-75                [-1, 6, 74]           3,078
           Conv1d-76                [-1, 6, 74]           3,078
          Chomp1d-77                [-1, 6, 60]               0
          Chomp1d-78                [-1, 6, 60]               0
           Conv1d-79                [-1, 6, 60]             390
       TConvLayer-80                [-1, 6, 60]               0
           Conv1d-81                [-1, 6, 74]             294
           Conv1d-82                [-1, 6, 74]             294
          Chomp1d-83                [-1, 6, 60]               0
          Chomp1d-84                [-1, 6, 60]               0
       TConvLayer-85                [-1, 6, 60]               0
       TConvBlock-86                [-1, 6, 60]               0
================================================================
Total params: 277,182
Trainable params: 277,182
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 2.23
Params size (MB): 1.06
Estimated Total Size (MB): 3.30
----------------------------------------------------------------