----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv1d-1              [-1, 16, 138]           2,064
            Conv1d-2              [-1, 16, 138]           2,064
           Chomp1d-3              [-1, 16, 124]               0
           Chomp1d-4              [-1, 16, 124]               0
        TConvLayer-5              [-1, 16, 124]               0
            Conv1d-6              [-1, 16, 138]           2,064
            Conv1d-7              [-1, 16, 138]           2,064
           Chomp1d-8              [-1, 16, 124]               0
           Chomp1d-9              [-1, 16, 124]               0
       TConvLayer-10              [-1, 16, 124]               0
           Conv1d-11              [-1, 16, 138]           2,064
           Conv1d-12              [-1, 16, 138]           2,064
          Chomp1d-13              [-1, 16, 124]               0
          Chomp1d-14              [-1, 16, 124]               0
       TConvLayer-15              [-1, 16, 124]               0
       TConvBlock-16              [-1, 16, 124]               0
      BatchNorm1d-17              [-1, 16, 124]              32
             ReLU-18              [-1, 16, 124]               0
           Conv1d-19              [-1, 16, 138]           2,064
           Conv1d-20              [-1, 16, 138]           2,064
          Chomp1d-21              [-1, 16, 124]               0
          Chomp1d-22              [-1, 16, 124]               0
       TConvLayer-23              [-1, 16, 124]               0
           Conv1d-24              [-1, 16, 138]           2,064
           Conv1d-25              [-1, 16, 138]           2,064
          Chomp1d-26              [-1, 16, 124]               0
          Chomp1d-27              [-1, 16, 124]               0
       TConvLayer-28              [-1, 16, 124]               0
           Conv1d-29              [-1, 16, 138]           2,064
           Conv1d-30              [-1, 16, 138]           2,064
          Chomp1d-31              [-1, 16, 124]               0
          Chomp1d-32              [-1, 16, 124]               0
       TConvLayer-33              [-1, 16, 124]               0
       TConvBlock-34              [-1, 16, 124]               0
      BatchNorm1d-35              [-1, 16, 124]              32
             ReLU-36              [-1, 16, 124]               0
           Conv1d-37              [-1, 32, 106]           4,128
           Conv1d-38              [-1, 32, 106]           4,128
          Chomp1d-39               [-1, 32, 92]               0
          Chomp1d-40               [-1, 32, 92]               0
           Conv1d-41               [-1, 32, 92]             544
       TConvLayer-42               [-1, 32, 92]               0
           Conv1d-43              [-1, 32, 106]           8,224
           Conv1d-44              [-1, 32, 106]           8,224
          Chomp1d-45               [-1, 32, 92]               0
          Chomp1d-46               [-1, 32, 92]               0
       TConvLayer-47               [-1, 32, 92]               0
           Conv1d-48              [-1, 32, 106]           8,224
           Conv1d-49              [-1, 32, 106]           8,224
          Chomp1d-50               [-1, 32, 92]               0
          Chomp1d-51               [-1, 32, 92]               0
       TConvLayer-52               [-1, 32, 92]               0
       TConvBlock-53               [-1, 32, 92]               0
      BatchNorm1d-54               [-1, 32, 92]              64
             ReLU-55               [-1, 32, 92]               0
           Conv1d-56              [-1, 32, 106]           8,224
           Conv1d-57              [-1, 32, 106]           8,224
          Chomp1d-58               [-1, 32, 92]               0
          Chomp1d-59               [-1, 32, 92]               0
       TConvLayer-60               [-1, 32, 92]               0
           Conv1d-61              [-1, 32, 106]           8,224
           Conv1d-62              [-1, 32, 106]           8,224
          Chomp1d-63               [-1, 32, 92]               0
          Chomp1d-64               [-1, 32, 92]               0
       TConvLayer-65               [-1, 32, 92]               0
           Conv1d-66              [-1, 32, 106]           8,224
           Conv1d-67              [-1, 32, 106]           8,224
          Chomp1d-68               [-1, 32, 92]               0
          Chomp1d-69               [-1, 32, 92]               0
       TConvLayer-70               [-1, 32, 92]               0
       TConvBlock-71               [-1, 32, 92]               0
      BatchNorm1d-72               [-1, 32, 92]              64
             ReLU-73               [-1, 32, 92]               0
           Conv1d-74               [-1, 64, 74]          16,448
           Conv1d-75               [-1, 64, 74]          16,448
          Chomp1d-76               [-1, 64, 60]               0
          Chomp1d-77               [-1, 64, 60]               0
           Conv1d-78               [-1, 64, 60]           2,112
       TConvLayer-79               [-1, 64, 60]               0
           Conv1d-80               [-1, 64, 74]          32,832
           Conv1d-81               [-1, 64, 74]          32,832
          Chomp1d-82               [-1, 64, 60]               0
          Chomp1d-83               [-1, 64, 60]               0
       TConvLayer-84               [-1, 64, 60]               0
       TConvBlock-85               [-1, 64, 60]               0
      BatchNorm1d-86               [-1, 64, 60]             128
             ReLU-87               [-1, 64, 60]               0
           Conv1d-88               [-1, 64, 74]          32,832
           Conv1d-89               [-1, 64, 74]          32,832
          Chomp1d-90               [-1, 64, 60]               0
          Chomp1d-91               [-1, 64, 60]               0
       TConvLayer-92               [-1, 64, 60]               0
           Conv1d-93               [-1, 64, 74]          32,832
           Conv1d-94               [-1, 64, 74]          32,832
          Chomp1d-95               [-1, 64, 60]               0
          Chomp1d-96               [-1, 64, 60]               0
       TConvLayer-97               [-1, 64, 60]               0
       TConvBlock-98               [-1, 64, 60]               0
      BatchNorm1d-99               [-1, 64, 60]             128
            ReLU-100               [-1, 64, 60]               0
          Conv1d-101              [-1, 128, 74]          65,664
          Conv1d-102              [-1, 128, 74]          65,664
         Chomp1d-103              [-1, 128, 60]               0
         Chomp1d-104              [-1, 128, 60]               0
          Conv1d-105              [-1, 128, 60]           8,320
      TConvLayer-106              [-1, 128, 60]               0
          Conv1d-107              [-1, 128, 74]         131,200
          Conv1d-108              [-1, 128, 74]         131,200
         Chomp1d-109              [-1, 128, 60]               0
         Chomp1d-110              [-1, 128, 60]               0
      TConvLayer-111              [-1, 128, 60]               0
      TConvBlock-112              [-1, 128, 60]               0
     BatchNorm1d-113              [-1, 128, 60]             256
            ReLU-114              [-1, 128, 60]               0
          Conv1d-115                [-1, 6, 74]           6,150
          Conv1d-116                [-1, 6, 74]           6,150
         Chomp1d-117                [-1, 6, 60]               0
         Chomp1d-118                [-1, 6, 60]               0
          Conv1d-119                [-1, 6, 60]             774
      TConvLayer-120                [-1, 6, 60]               0
          Conv1d-121                [-1, 6, 74]             294
          Conv1d-122                [-1, 6, 74]             294
         Chomp1d-123                [-1, 6, 60]               0
         Chomp1d-124                [-1, 6, 60]               0
      TConvLayer-125                [-1, 6, 60]               0
      TConvBlock-126                [-1, 6, 60]               0
================================================================
Total params: 764,222
Trainable params: 764,222
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 3.19
Params size (MB): 2.92
Estimated Total Size (MB): 6.12
----------------------------------------------------------------