Motor Hybrid

----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv1d-1               [-1, 10, 77]             810
            Conv1d-2               [-1, 10, 77]             810
           Chomp1d-3               [-1, 10, 63]               0
           Chomp1d-4               [-1, 10, 63]               0
        TConvLayer-5               [-1, 10, 63]               0
            Conv1d-6               [-1, 10, 77]             810
            Conv1d-7               [-1, 10, 77]             810
           Chomp1d-8               [-1, 10, 63]               0
           Chomp1d-9               [-1, 10, 63]               0
       TConvLayer-10               [-1, 10, 63]               0
           Conv1d-11               [-1, 10, 77]             810
           Conv1d-12               [-1, 10, 77]             810
          Chomp1d-13               [-1, 10, 63]               0
          Chomp1d-14               [-1, 10, 63]               0
       TConvLayer-15               [-1, 10, 63]               0
       TConvBlock-16               [-1, 10, 63]               0
      BatchNorm1d-17               [-1, 10, 63]              20
             ReLU-18               [-1, 10, 63]               0
           Conv1d-19               [-1, 10, 77]             810
           Conv1d-20               [-1, 10, 77]             810
          Chomp1d-21               [-1, 10, 63]               0
          Chomp1d-22               [-1, 10, 63]               0
       TConvLayer-23               [-1, 10, 63]               0
           Conv1d-24               [-1, 10, 77]             810
           Conv1d-25               [-1, 10, 77]             810
          Chomp1d-26               [-1, 10, 63]               0
          Chomp1d-27               [-1, 10, 63]               0
       TConvLayer-28               [-1, 10, 63]               0
           Conv1d-29               [-1, 10, 77]             810
           Conv1d-30               [-1, 10, 77]             810
          Chomp1d-31               [-1, 10, 63]               0
          Chomp1d-32               [-1, 10, 63]               0
       TConvLayer-33               [-1, 10, 63]               0
       TConvBlock-34               [-1, 10, 63]               0
      BatchNorm1d-35               [-1, 10, 63]              20
             ReLU-36               [-1, 10, 63]               0
           Linear-37                  [-1, 128]          80,768
             ReLU-38                  [-1, 128]               0
           Linear-39                    [-1, 4]             532
================================================================
Total params: 91,060
Trainable params: 91,060
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 0.19
Params size (MB): 0.35
Estimated Total Size (MB): 0.54
----------------------------------------------------------------

Accel Error V1

----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv1d-1               [-1, 10, 77]             810
            Conv1d-2               [-1, 10, 77]             810
           Chomp1d-3               [-1, 10, 63]               0
           Chomp1d-4               [-1, 10, 63]               0
        TConvLayer-5               [-1, 10, 63]               0
            Conv1d-6               [-1, 10, 77]             810
            Conv1d-7               [-1, 10, 77]             810
           Chomp1d-8               [-1, 10, 63]               0
           Chomp1d-9               [-1, 10, 63]               0
       TConvLayer-10               [-1, 10, 63]               0
           Conv1d-11               [-1, 10, 77]             810
           Conv1d-12               [-1, 10, 77]             810
          Chomp1d-13               [-1, 10, 63]               0
          Chomp1d-14               [-1, 10, 63]               0
       TConvLayer-15               [-1, 10, 63]               0
       TConvBlock-16               [-1, 10, 63]               0
      BatchNorm1d-17               [-1, 10, 63]              20
             ReLU-18               [-1, 10, 63]               0
           Conv1d-19               [-1, 10, 77]             810
           Conv1d-20               [-1, 10, 77]             810
          Chomp1d-21               [-1, 10, 63]               0
          Chomp1d-22               [-1, 10, 63]               0
       TConvLayer-23               [-1, 10, 63]               0
           Conv1d-24               [-1, 10, 77]             810
           Conv1d-25               [-1, 10, 77]             810
          Chomp1d-26               [-1, 10, 63]               0
          Chomp1d-27               [-1, 10, 63]               0
       TConvLayer-28               [-1, 10, 63]               0
           Conv1d-29               [-1, 10, 77]             810
           Conv1d-30               [-1, 10, 77]             810
          Chomp1d-31               [-1, 10, 63]               0
          Chomp1d-32               [-1, 10, 63]               0
       TConvLayer-33               [-1, 10, 63]               0
       TConvBlock-34               [-1, 10, 63]               0
      BatchNorm1d-35               [-1, 10, 63]              20
             ReLU-36               [-1, 10, 63]               0
           Linear-37                  [-1, 128]          80,768
             ReLU-38                  [-1, 128]               0
           Linear-39                    [-1, 6]             798
================================================================
Total params: 91,326
Trainable params: 91,326
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 0.19
Params size (MB): 0.35
Estimated Total Size (MB): 0.54
----------------------------------------------------------------
